---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcEnabled
source: html/80272914-1cbc-c6a3-12e8-7de1f607f676.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcEnabled Property

"Calculation Rules"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrCalcEnabled { get; }
```